RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drv_pmhw/drv_pmhw_l4.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author          Notes
 * 2020-04-08     Sunwancn        first version
 */

#include <rtthread.h>

#if defined(RT_USING_PM)

#include <drv_pmhw.h>

/* ------------------ PM oscillator start ------------------ */
#if defined(PWR_CR5_R1MODE)
  /* STM32L4+ */
  #define OSC_CONF_SYS_FREQ_MAX       120U    /* Max system clock  MHz */
  #define OSC_CONF_SYS_FREQ_NORMAL    120U    /* Normal system clock  MHz */

  #define OSC_CONF_PLLM_FREQ_MIN      3U      /* Min pllm clock  MHz */
  #define OSC_CONF_PLLM_FREQ_MAX      8U      /* Max pllm clock  MHz */
  #define OSC_CONF_PLL_VCO_FREQ_MIN   64U     /* Min pll vco clock  MHz */
  #define OSC_CONF_PLL_VCO_FREQ_MAX   344U    /* Max pll vco clock  MHz */
  #define OSC_CONF_PLLM_DIV_MIN       1U      /* Min pllm divider */
  #define OSC_CONF_PLLM_DIV_MAX       16U     /* Max pllm divider */
  #define OSC_CONF_PLLN_MUL_MIN       8U      /* Min plln multiplier */
  #define OSC_CONF_PLLN_MUL_MAX       127U    /* Max plln multiplier */
  #define OSC_CONF_PLLR_DIV_MIN       2U      /* Min pllr divider */
  #define OSC_CONF_PLLR_DIV_MAX       8U      /* Max pllr divider */
  #define OSC_CONF_PLLQ_DIV_MIN       2U      /* Min pllq divider */
  #define OSC_CONF_PLLQ_DIV_MAX       8U      /* Max pllq divider */

  #define OSC_CONF_LOW_POW_RUN_FREQ   2U      /* Low-power Run mode frequency  MHz */
  #define PM_MSI_RANGE_MAX_NUMS       12U
  #define PM_POW_VOLT_SCALE_NUMS      3U
  #define FLASH_LATENCY_MAX_NUMS      6U
#else
  /* STM32L4 */
  #define OSC_CONF_SYS_FREQ_MAX       80U     /* Max system clock  MHz */
  #define OSC_CONF_SYS_FREQ_NORMAL    80U     /* Normal system clock  MHz */

  #define OSC_CONF_PLLM_FREQ_MIN      4U      /* Min pllm clock  MHz */
  #define OSC_CONF_PLLM_FREQ_MAX      16U     /* Max pllm clock  MHz */
  #define OSC_CONF_PLL_VCO_FREQ_MIN   64U     /* Min pll vco clock  MHz */
  #define OSC_CONF_PLL_VCO_FREQ_MAX   344U    /* Max pll vco clock  MHz */
  #define OSC_CONF_PLLM_DIV_MIN       1U      /* Min pllm divider */
  #define OSC_CONF_PLLM_DIV_MAX       8U      /* Max pllm divider */
  #define OSC_CONF_PLLN_MUL_MIN       8U      /* Min plln multiplier */
  #define OSC_CONF_PLLN_MUL_MAX       86U     /* Max plln multiplier */
  #define OSC_CONF_PLLR_DIV_MIN       2U      /* Min pllr divider */
  #define OSC_CONF_PLLR_DIV_MAX       8U      /* Max pllr divider */
  #define OSC_CONF_PLLQ_DIV_MIN       2U      /* Min pllq divider */
  #define OSC_CONF_PLLQ_DIV_MAX       8U      /* Max pllq divider */

  #define OSC_CONF_LOW_POW_RUN_FREQ   2U      /* Low-power Run mode frequency  MHz */
  #define PM_MSI_RANGE_MAX_NUMS       12U
  #define PM_POW_VOLT_SCALE_NUMS      2U
  #define FLASH_LATENCY_MAX_NUMS      5U
#endif

struct PM_RCC_conf
{
    rt_uint32_t mode;
    rt_uint32_t sysclk_source;
    rt_uint32_t clk48_source;
    rt_uint32_t pll_state;
    rt_uint32_t pllm;
    rt_uint32_t plln;
    rt_uint32_t pllr;
    rt_uint32_t pllq;
#if defined(RCC_PLLP_SUPPORT)
    rt_uint32_t pllp;
#endif
    rt_uint32_t ahb_div;
    rt_uint32_t latency;
    rt_uint32_t volt_scale;
    rt_uint32_t msi_range;
    rt_bool_t low_pow_run_en;
};
static struct PM_RCC_conf _pm_conf[PM_RUN_MODE_MAX] = {0};

static struct PM_RCC_Osc
{
    rt_uint32_t init;
    rt_uint32_t osc_type;
    rt_uint32_t osc_freq;
}
_pm_osc = {0};

static void (* _pm_set_sysclock[PM_RUN_MODE_MAX])(void) = {0};
static const rt_uint32_t _pm_volt_scale_tab[PM_POW_VOLT_SCALE_NUMS][3] =
{
    /* voltage range, frequency step for flash latency, max HCLK */
#if defined(PWR_CR5_R1MODE)
    /* STM32L4+ */
    {PWR_REGULATOR_VOLTAGE_SCALE2,        8U,  26U},
    {PWR_REGULATOR_VOLTAGE_SCALE1,       20U,  80U},
    {PWR_REGULATOR_VOLTAGE_SCALE1_BOOST, 20U, 120U},
#else
    {PWR_REGULATOR_VOLTAGE_SCALE2,        6U,  26U},
    {PWR_REGULATOR_VOLTAGE_SCALE1,       16U,  80U},
#endif
};
static const rt_uint16_t _pm_msi_range_tab[PM_MSI_RANGE_MAX_NUMS] =
{
    100U, 200U, 400U, 800U, 1000U, 2000U, 4000U, 8000U, 16000U, 24000U, 32000U, 48000U
};

RT_WEAK rt_uint16_t pm_run_freq[PM_RUN_MODE_MAX][2] =
{
    /* The actual frequency is 1/divisor MHz, divisor = {1, 1000} */
    /* {sysclk frequency, divisor} */
    {OSC_CONF_SYS_FREQ_MAX,    1},    /* High speed */
    {OSC_CONF_SYS_FREQ_NORMAL, 1},    /* Normal speed */
    {24,                       1},    /* Medium speed */
    {2,                        1},    /* Low speed, MSI clock 2.0 MHz */
};

/* Get the greatest common divisor by Stein algorithm */
static rt_uint32_t get_stein_div(rt_uint32_t x, rt_uint32_t y)
{
    rt_uint32_t tmp, cnt = 0;

    RT_ASSERT(x > 0 && y > 0);

    /* bigger --> x, smaller --> y */
    if (x < y)
    {
        tmp = x;
        x = y;
        y = tmp;
    }

    while (x != y)
    {
        if (x & 1U)
        {
            if (y & 1U)
            {
                y = (x - y) >> 1U;
                x -= y;
            }
            else
            {
                y >>= 1U;
            }
        }
        else
        {
            if (y & 1U)
            {
                x >>= 1U;
                if (x < y)
                {
                    tmp = x;
                    x = y;
                    y = tmp;
                }
            }
            else
            {
                x >>= 1U;
                y >>= 1U;
                ++cnt;
            }
        }
    }
    return (x << cnt);
}

/* Find the MSI frequency(KHz) range */
static rt_uint32_t find_msi_range(rt_uint32_t freq, rt_uint32_t *rp)
{
    rt_uint32_t i;
    for (i = 0U; i < PM_MSI_RANGE_MAX_NUMS; i++)
    {
        if ((_pm_msi_range_tab[i] >= freq) || (i == PM_MSI_RANGE_MAX_NUMS - 1U))
        {
            freq = _pm_msi_range_tab[i];
            *rp = i << RCC_CR_MSIRANGE_Pos;
            break;
        }
    }
    return freq;
}

/* Find flash read access latency */
static rt_uint32_t find_flash_latency(rt_uint32_t freq, rt_uint32_t fs)
{
    rt_uint32_t i;
    rt_uint32_t latency = ((rt_uint32_t)(FLASH_LATENCY_MAX_NUMS - 1U) << FLASH_ACR_LATENCY_Pos) & FLASH_ACR_LATENCY;
    for (i = 1; i <= FLASH_LATENCY_MAX_NUMS; i++)
    {
        if (freq <= fs * i)
        {
            latency = ((i - 1U) << FLASH_ACR_LATENCY_Pos) & FLASH_ACR_LATENCY;
            break;
        }
    }
    return latency;
}

/**
 * This function configure clock tree
 *
 * @return SYSCLK or HCLK frequency (MHz)
 */
static rt_uint16_t pm_hw_clk_config(struct PM_RCC_conf *conf, rt_uint32_t freq_base, rt_uint32_t freq_hclk)
{
    rt_uint32_t freq, freq_div, div, divm, divr, divq, mul, fs, i, freq_vco = 0U;
    rt_bool_t find = RT_FALSE;
    rt_bool_t usbclk_use_pll = RT_TRUE;

    freq_div = pm_run_freq[conf->mode][1];

    RT_ASSERT(conf != RT_NULL && freq_hclk > 0);
    RT_ASSERT(freq_div == 1U || freq_div == 1000U);

    freq = freq_base = freq_base / 1000U * freq_div;

    if (_pm_osc.osc_type == RCC_OSCILLATORTYPE_MSI)
    {
        find_msi_range(freq_base * 1000U / freq_div, &conf->msi_range);
    }

    if (freq_div == 1 && conf->pll_state == RCC_PLL_ON && freq_hclk >= OSC_CONF_PLL_VCO_FREQ_MIN / OSC_CONF_PLLR_DIV_MAX)
    {
        /* Use PLL */
        conf->sysclk_source = RCC_SYSCLKSOURCE_PLLCLK;

#if defined(RCC_PLLSAI1_SUPPORT) && (defined(USB_OTG_FS) || defined(USB)) && !defined(PWR_CR5_R1MODE)
        /* Not STM32L4+ */
        if (_pm_conf[PM_RUN_MODE_NORMAL_SPEED].clk48_source == RCC_USBCLKSOURCE_PLLSAI1)
        {
            /* Get the PLLM divider */
            divm = conf->pllm = _pm_conf[PM_RUN_MODE_NORMAL_SPEED].pllm;

            while (1)
            {
                /* Get the PLLN multiplier */
                mul = (freq_hclk << 1U) * divm / get_stein_div((freq_hclk << 1U), freq_base);
                freq_vco = freq_base * mul / divm;

                i = 1U;
                while (mul * i < OSC_CONF_PLLN_MUL_MIN || freq_vco * i < OSC_CONF_PLL_VCO_FREQ_MIN)
                    i++;
                mul *= i;
                freq_vco *= i;
                /* Get the PLLR divider */
                divr = freq_vco / freq_hclk;

                if (freq_vco <= OSC_CONF_PLL_VCO_FREQ_MAX && mul <= OSC_CONF_PLLN_MUL_MAX
                        && divr <= OSC_CONF_PLLR_DIV_MAX)
                {
                    /* Correct */
                    freq = freq_vco / divr;
                    conf->plln = mul;
                    conf->pllr = divr & 0xfe;
                    conf->pllq = _pm_conf[PM_RUN_MODE_NORMAL_SPEED].pllq;
                    conf->ahb_div = RCC_SYSCLK_DIV1;

                    break;
                }

