RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drv_pmhw/drv_pmhw_l4.c
                /* Does not meet the optimal frequency */
                freq_hclk--;
                if (freq_hclk < OSC_CONF_PLL_VCO_FREQ_MIN / OSC_CONF_PLLR_DIV_MAX)
                {
                    rt_kprintf("error: Incorrect system frequency settings.\n");
                    RT_ASSERT(0);
                    break;
                }
            }
        }
        else
#endif
        {
            while (1)
            {
#if (defined(USB_OTG_FS) || defined(USB)) && (defined(RT_USING_USB_HOST) || defined(RT_USING_USB_DEVICE))
                if (usbclk_use_pll && (((freq_hclk % 48U == 0) && (freq_hclk / 48U <= 4U))
                                       || ((48U % freq_hclk == 0) && (48U / freq_hclk <= 4U))))
                {
                    if (freq_hclk / 48U > 0)
                    {
                        div = get_stein_div((freq_hclk << 1U), freq_base);
                    }
                    else
                    {
                        div = get_stein_div((48U << 1U), freq_base);
                    }
                }
                else
                {
                    div = get_stein_div((freq_hclk << 1U), freq_base);
                }
#else
                usbclk_use_pll = RT_FALSE;
                div = get_stein_div((freq_hclk << 1U), freq_base);
#endif
                mul = (freq_hclk << 1U) / div;
                div = (freq_base / div) << 1U;

                i = 1U;
                while (!find)
                {
                    /* Get the PLLN multiplier */
                    while (mul * i < OSC_CONF_PLLN_MUL_MIN || div * i < OSC_CONF_PLLM_DIV_MIN * OSC_CONF_PLLR_DIV_MIN)
                        i++;
                    mul *= i;
                    div *= i;

                    if (mul > OSC_CONF_PLLN_MUL_MAX || div > OSC_CONF_PLLM_DIV_MAX * OSC_CONF_PLLR_DIV_MAX)
                        break;

                    /* Get the PLLM divider */
                    for (divm = OSC_CONF_PLLM_DIV_MIN; divm <= OSC_CONF_PLLM_DIV_MAX; divm++)
                    {
                        freq = freq_base / divm;
                        if (freq > OSC_CONF_PLLM_FREQ_MAX || div / divm > OSC_CONF_PLLR_DIV_MAX
                                || freq * mul > OSC_CONF_PLL_VCO_FREQ_MAX)
                            continue;
                        if (freq < OSC_CONF_PLLM_FREQ_MIN || div / divm < OSC_CONF_PLLR_DIV_MIN
                                || freq * mul < OSC_CONF_PLL_VCO_FREQ_MIN)
                            break;

                        if (div % divm == 0)
                        {
                            divr = freq * mul / freq_hclk;
                            /* Get the PLLQ divider */
#if (defined(USB_OTG_FS) || defined(USB)) && (defined(RT_USING_USB_HOST) || defined(RT_USING_USB_DEVICE))
                            divq = freq * mul / 48U;
                            if (divq > OSC_CONF_PLLQ_DIV_MAX)
                                continue;
                            if (divq < OSC_CONF_PLLQ_DIV_MIN)
                                break;
                            conf->clk48_source = RCC_USBCLKSOURCE_PLL;
#else
                            divq = OSC_CONF_PLLQ_DIV_MAX;
#endif
                            find = RT_TRUE;
                            break;
                        }
                    }
                    i++;
                }

                if (find)
                    break;

                /* Does not meet the optimal frequency */
#if (defined(USB_OTG_FS) || defined(USB)) && defined(RCC_HSI48_SUPPORT) && !defined(PWR_CR5_R1MODE) && \
    (defined(RT_USING_USB_HOST) || defined(RT_USING_USB_DEVICE))
                if (usbclk_use_pll)
                {
                    usbclk_use_pll = RT_FALSE;
                    conf->clk48_source = RCC_USBCLKSOURCE_HSI48;
                }
                else
#endif
                {
                    freq_hclk--;
                    usbclk_use_pll = RT_TRUE;
                    if (freq_hclk < (OSC_CONF_PLL_VCO_FREQ_MIN / OSC_CONF_PLLR_DIV_MAX))
                    {
                        rt_kprintf("error: Incorrect system frequency settings.\n");
                        RT_ASSERT(0);
                        break;
                    }
                }
            }

            freq = freq_base * mul / (divm * divr);

            conf->pllm = divm;
            conf->plln = mul;
            conf->pllr = divr & 0xfe;
            conf->pllq = divq & 0xfe;
            conf->ahb_div = RCC_SYSCLK_DIV1;
        }
#if defined(RCC_PLLP_SUPPORT)
        conf->pllp = _pm_conf[PM_RUN_MODE_NORMAL_SPEED].pllp;
#endif
    }
    else
    {
        conf->pll_state = RCC_PLL_OFF;

        /* Select MSI and find the MSI frequency range */
        conf->sysclk_source = RCC_SYSCLKSOURCE_MSI;

        freq_hclk = freq_hclk * 1000U / freq_div;
        freq_div = 1000U;
        freq = find_msi_range(freq_hclk, &conf->msi_range);
        conf->ahb_div = RCC_SYSCLK_DIV1;

        pm_run_freq[conf->mode][1] = freq_div;

        /* Configure the Low-power Run mode */
        if ((freq / freq_div) <= OSC_CONF_LOW_POW_RUN_FREQ)
            conf->low_pow_run_en = RT_TRUE;
        else
            conf->low_pow_run_en = RT_FALSE;
    }

    (void)freq_vco;
    (void)div;
    (void)divm;
    (void)divr;
    (void)divq;
    (void)mul;
    (void)find;
    (void)usbclk_use_pll;

    /* Find voltage scales range */
    conf->volt_scale = _pm_volt_scale_tab[PM_POW_VOLT_SCALE_NUMS - 1U][0];
    fs = _pm_volt_scale_tab[0][1];
    for (i = 0; i < PM_POW_VOLT_SCALE_NUMS; i++)
    {
        if ((freq / freq_div) <= _pm_volt_scale_tab[i][2])
        {
            conf->volt_scale = _pm_volt_scale_tab[i][0];
            /* frequency step for flash latency */
            fs = _pm_volt_scale_tab[i][1];
            break;
        }
    }

    conf->latency = find_flash_latency(freq / freq_div, fs);

    return (rt_uint16_t)freq;
}

static int pm_rcc_conf_init(void)
{
    rt_uint32_t mode = PM_RUN_MODE_NORMAL_SPEED;
    struct PM_RCC_conf *conf = &_pm_conf[mode];
    struct PM_RCC_Osc *osc = &_pm_osc;

    if (!osc->init)
    {
        /* Clone the main clock tree */
        switch (__HAL_RCC_GET_SYSCLK_SOURCE())
        {
        case RCC_SYSCLKSOURCE_STATUS_HSE:  /* HSE used as system clock */
            conf->pll_state = RCC_PLL_OFF;
            conf->sysclk_source = RCC_SYSCLKSOURCE_HSE;
            osc->osc_type = RCC_OSCILLATORTYPE_HSE;
            osc->osc_freq = HSE_VALUE / 1000U;
            break;
        case RCC_SYSCLKSOURCE_STATUS_PLLCLK:  /* PLL used as system clock */
            conf->pll_state = RCC_PLL_ON;
            conf->sysclk_source = RCC_SYSCLKSOURCE_PLLCLK;

