RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drv_pmhw/drv_pmhw_l4.c
            if (__HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSE)
            {
                osc->osc_type = RCC_OSCILLATORTYPE_HSE;
                osc->osc_freq = HSE_VALUE / 1000U;
            }
            else if (__HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSI)
            {
                osc->osc_type = RCC_OSCILLATORTYPE_HSI;
                osc->osc_freq = HSI_VALUE / 1000U;
            }
            else
            {
                conf->msi_range = __HAL_RCC_GET_MSI_RANGE();
                osc->osc_type = RCC_OSCILLATORTYPE_MSI;
                osc->osc_freq = _pm_msi_range_tab[conf->msi_range >> RCC_CR_MSIRANGE_Pos];
            }
            break;
        case RCC_SYSCLKSOURCE_STATUS_HSI:    /* HSI used as system clock source */
            conf->pll_state = RCC_PLL_OFF;
            conf->sysclk_source = RCC_SYSCLKSOURCE_HSI;
            osc->osc_type = RCC_OSCILLATORTYPE_HSI;
            osc->osc_freq = HSI_VALUE / 1000U;
            break;
        case RCC_SYSCLKSOURCE_STATUS_MSI:  /* MSI used as system clock source */
        default:  /* MSI used as system clock */
            conf->pll_state = RCC_PLL_OFF;
            conf->sysclk_source = RCC_SYSCLKSOURCE_MSI;
            conf->msi_range = __HAL_RCC_GET_MSI_RANGE();
            osc->osc_type = RCC_OSCILLATORTYPE_MSI;
            osc->osc_freq = _pm_msi_range_tab[conf->msi_range >> RCC_CR_MSIRANGE_Pos];
            break;
        }

        /* Get the normal run speed register settings */
        if (conf->pll_state == RCC_PLL_ON)
        {
            conf->pllm = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLM) >> RCC_PLLCFGR_PLLM_Pos) + 1U;
            conf->plln = (RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> RCC_PLLCFGR_PLLN_Pos;
            conf->pllr = (((RCC->PLLCFGR & RCC_PLLCFGR_PLLR) >> RCC_PLLCFGR_PLLR_Pos) + 1U) << 1U;
            conf->pllq = (((RCC->PLLCFGR & RCC_PLLCFGR_PLLQ) >> RCC_PLLCFGR_PLLQ_Pos) + 1U) << 1U;
#if defined(RCC_PLLP_SUPPORT)
  #if defined(RCC_PLLP_DIV_2_31_SUPPORT)
            conf->pllp = (RCC->PLLCFGR & RCC_PLLCFGR_PLLPDIV) >> RCC_PLLCFGR_PLLPDIV_Pos;
  #else
            conf->pllp = (RCC->PLLCFGR & RCC_PLLCFGR_PLLP) >> RCC_PLLCFGR_PLLP_Pos;
  #endif
#endif
        }
#if defined(USB_OTG_FS) || defined(USB)
        conf->clk48_source = RCC->CCIPR & RCC_CCIPR_CLK48SEL;
#endif
        conf->ahb_div = RCC->CFGR & RCC_CFGR_HPRE;
        conf->latency = FLASH->ACR & FLASH_ACR_LATENCY;
        conf->volt_scale = HAL_PWREx_GetVoltageRange();

        /* Initialize the _pm_conf[] arrays */
        for (mode = PM_RUN_MODE_HIGH_SPEED; mode < PM_RUN_MODE_MAX; mode++)
        {
            conf = &_pm_conf[mode];
            conf->mode = mode;

            switch (mode)
            {
            case PM_RUN_MODE_HIGH_SPEED:
                _pm_set_sysclock[mode] = pm_system_clock_high;
                if (pm_run_freq[mode][0] > pm_run_freq[PM_RUN_MODE_NORMAL_SPEED][0])
                {
                    conf->pll_state = RCC_PLL_ON;
                    pm_run_freq[mode][0] = pm_hw_clk_config(conf, osc->osc_freq, pm_run_freq[mode][0]);
                }
                else
                {
                    rt_memcpy(conf, &_pm_conf[PM_RUN_MODE_NORMAL_SPEED], sizeof(struct PM_RCC_conf));
                    pm_run_freq[mode][0] = pm_run_freq[PM_RUN_MODE_NORMAL_SPEED][0];
                }
                break;
            case PM_RUN_MODE_NORMAL_SPEED:
                _pm_set_sysclock[mode] = pm_system_clock_normal;
                break;
            case PM_RUN_MODE_MEDIUM_SPEED:
                _pm_set_sysclock[mode] = pm_system_clock_medium;
                conf->pll_state = RCC_PLL_ON;
                pm_run_freq[mode][0] = pm_hw_clk_config(conf, osc->osc_freq, pm_run_freq[mode][0]);
                break;
            case PM_RUN_MODE_LOW_SPEED:
                _pm_set_sysclock[mode] = pm_system_clock_low;
                conf->pll_state = RCC_PLL_OFF;
                pm_run_freq[mode][0] = pm_hw_clk_config(conf, osc->osc_freq, pm_run_freq[mode][0]);
                break;
            default:
                RT_ASSERT(0);
                break;
            }
        }

        osc->init = 1U;
    }

    return 0;
}
INIT_DEVICE_EXPORT(pm_rcc_conf_init);

/* System Clock Configuration */
static void systemclock_run(struct PM_RCC_conf *conf)
{
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};

#if defined(PWR_CR5_R1MODE)
    /* STM32L4+ */
    if (HAL_IS_BIT_CLR(PWR->CR5, PWR_CR5_R1MODE) && conf->volt_scale == PWR_REGULATOR_VOLTAGE_SCALE2)
    {
        /* PWR_REGULATOR_VOLTAGE_SCALE1_BOOST --> PWR_REGULATOR_VOLTAGE_SCALE2 */
        /* with AHB prescaler divider 2 as first step */
        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK;
        RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
        {
            Error_Handler();
        }
    }
#endif

    if ((conf->pll_state == RCC_PLL_ON && _pm_osc.osc_type == RCC_OSCILLATORTYPE_HSE)
            || conf->sysclk_source == RCC_SYSCLKSOURCE_HSE)
    {
        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    }
    else if ((conf->pll_state == RCC_PLL_ON && _pm_osc.osc_type == RCC_OSCILLATORTYPE_HSI)
             || conf->sysclk_source == RCC_SYSCLKSOURCE_HSI)
    {
        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
        RCC_OscInitStruct.HSIState = RCC_HSI_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    }
    else
    {
        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
        RCC_OscInitStruct.MSIState = RCC_MSI_ON;
        RCC_OscInitStruct.MSIClockRange = conf->msi_range;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
    }

    RCC_OscInitStruct.PLL.PLLState = conf->pll_state;
    if (conf->pll_state == RCC_PLL_ON)
    {
        RCC_OscInitStruct.PLL.PLLM = conf->pllm;
        RCC_OscInitStruct.PLL.PLLN = conf->plln;
        RCC_OscInitStruct.PLL.PLLR = conf->pllr;
        RCC_OscInitStruct.PLL.PLLQ = conf->pllq;
#if defined(RCC_PLLP_SUPPORT)
        RCC_OscInitStruct.PLL.PLLP = conf->pllp;
#endif
    }

#if defined(RCC_HSI48_SUPPORT) && (defined(RT_USING_USB_HOST) || defined(RT_USING_USB_DEVICE))
    if (conf->clk48_source == RCC_USBCLKSOURCE_HSI48)
    {
        RCC_OscInitStruct.OscillatorType |= RCC_OSCILLATORTYPE_HSI48;
        RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
    }
#endif

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /* Reconfigure the SYSCLK clocks dividers */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK;
    RCC_ClkInitStruct.SYSCLKSource = conf->sysclk_source;
#if defined(PWR_CR5_R1MODE)
    /* STM32L4+ */
    if (conf->volt_scale == PWR_REGULATOR_VOLTAGE_SCALE1_BOOST)
    {
        /* with AHB prescaler divider 2 as first step */
        RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
        if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
        {
            Error_Handler();
        }

        /* AHB prescaler divider as second step */
        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK;
    }
#endif
    RCC_ClkInitStruct.AHBCLKDivider = conf->ahb_div;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, conf->latency) != HAL_OK)
    {
        Error_Handler();
    }

#if (defined(USB_OTG_FS) || defined(USB)) && (defined(RT_USING_USB_HOST) || defined(RT_USING_USB_DEVICE))
    __HAL_RCC_USB_CONFIG(conf->clk48_source);
#endif
}

static void sysclock_msi_on(rt_uint32_t mode)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    struct PM_RCC_conf *conf = &_pm_conf[mode];
    rt_uint32_t freq, sysclk_source;
    rt_uint32_t latency = FLASH_LATENCY_0;

