RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drv_pmhw/drv_pmhw_l4.c
    sysclk_source = __HAL_RCC_GET_SYSCLK_SOURCE();
    if (sysclk_source == RCC_SYSCLKSOURCE_STATUS_MSI ||
        (sysclk_source == RCC_SYSCLKSOURCE_STATUS_PLLCLK && __HAL_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_MSI))
    {
        freq = _pm_msi_range_tab[conf->msi_range >> RCC_CR_MSIRANGE_Pos] / 1000U;
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
    }
    else
    {
        freq = HSI_VALUE / 1000000U;
        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
        RCC_OscInitStruct.HSIState = RCC_HSI_ON;
        RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE; /* No update on PLL */
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
        {
            Error_Handler();
        }
        RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    latency = find_flash_latency(freq, _pm_volt_scale_tab[conf->volt_scale][1]);
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, latency) != HAL_OK)
    {
        Error_Handler();
    }
}

static void sysclock_msi_off(rt_uint32_t mode)
{
    if (_pm_osc.osc_type != RCC_OSCILLATORTYPE_HSI && _pm_conf[mode].sysclk_source != RCC_SYSCLKSOURCE_HSI)
        __HAL_RCC_HSI_DISABLE();
    else if (_pm_osc.osc_type != RCC_OSCILLATORTYPE_MSI && _pm_conf[mode].sysclk_source != RCC_SYSCLKSOURCE_MSI)
        __HAL_RCC_MSI_DISABLE();
}

/**
  * @brief  Configures system clock after wake-up from STOP: enable MSI or HSI, PLL
  *         and select PLL as system clock source.
  * @param  None
  * @retval None
  */
static void sysclock_reconfig(rt_uint32_t mode)
{
    if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_MSI && _pm_conf[mode].sysclk_source == RCC_SYSCLKSOURCE_MSI)
        return;

    sysclock_msi_on(mode);
    _pm_set_sysclock[mode]();
}

/* System Clock Configuration On High Speed */
RT_WEAK void pm_system_clock_high(void)
{
    systemclock_run(&_pm_conf[PM_RUN_MODE_HIGH_SPEED]);
}

/* System Clock Configuration On Normal Speed */
RT_WEAK void pm_system_clock_normal(void)
{
    systemclock_run(&_pm_conf[PM_RUN_MODE_NORMAL_SPEED]);
}

/* System Clock Configuration On Medium Speed */
RT_WEAK void pm_system_clock_medium(void)
{
    systemclock_run(&_pm_conf[PM_RUN_MODE_MEDIUM_SPEED]);
}

/* System Clock Configuration On Low Speed */
RT_WEAK void pm_system_clock_low(void)
{
    systemclock_run(&_pm_conf[PM_RUN_MODE_LOW_SPEED]);
}

/* --------------------- PM oscillator end --------------------- */

#if defined(RT_USING_SERIAL)
static void uart_console_reconfig(void)
{
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;

    rt_device_control(rt_console_get_device(), RT_DEVICE_CTRL_CONFIG, &config);
}
#endif

/**
 * This function will put STM32 into sleep mode.
 *
 * @param pm pointer to power manage structure
 */
void pm_hw_sleep(struct rt_pm *pm, rt_uint8_t mode)
{
    switch (mode)
    {
    case PM_SLEEP_MODE_NONE:
        break;

    case PM_SLEEP_MODE_IDLE:
        if (pm->run_mode == PM_RUN_MODE_LOW_SPEED)
        {
            /* Enter LP SLEEP Mode, Enable low-power regulator */
            HAL_PWR_EnterSLEEPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI);
        }
        else
        {
            /* Enter SLEEP Mode, Main regulator is ON */
            HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
        }
        break;

    case PM_SLEEP_MODE_LIGHT:
        if (pm->run_mode == PM_RUN_MODE_LOW_SPEED)
        {
            __HAL_FLASH_SLEEP_POWERDOWN_ENABLE();
            /* Enter LP SLEEP Mode, Enable low-power regulator */
            HAL_PWR_EnterSLEEPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI);
            __HAL_FLASH_SLEEP_POWERDOWN_DISABLE();
        }
        else
        {
            /* Enter SLEEP Mode, Main regulator is ON */
            HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
        }
        break;

    case PM_SLEEP_MODE_DEEP:
        /* Disable SysTick interrupt */
        CLEAR_BIT(SysTick->CTRL, (rt_uint32_t)SysTick_CTRL_TICKINT_Msk);

        if (pm->run_mode == PM_RUN_MODE_LOW_SPEED)
        {
            /* Clear LPR bit to back the normal run mode */
            CLEAR_BIT(PWR->CR1, PWR_CR1_LPR);
            /* Enter STOP 2 mode  */
            HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
            /* Set Regulator parameter to lowpower run mode */
            SET_BIT(PWR->CR1, PWR_CR1_LPR);
        }
        else
        {
            /* Enter STOP 2 mode  */
            HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);
        }

        /* Enable SysTick interrupt */
        SET_BIT(SysTick->CTRL, (rt_uint32_t)SysTick_CTRL_TICKINT_Msk);
        /* Re-configure the system clock */
        sysclock_reconfig(pm->run_mode);
        break;

    case PM_SLEEP_MODE_STANDBY:
        __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
        /* Enter STANDBY mode */
        HAL_PWR_EnterSTANDBYMode();
        break;

    case PM_SLEEP_MODE_SHUTDOWN:
        __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
        /* Enter SHUTDOWNN mode */
        HAL_PWREx_EnterSHUTDOWNMode();
        break;

    default:
        RT_ASSERT(0);
        break;
    }
}

void pm_hw_run(struct rt_pm *pm, rt_uint8_t mode)
{
    static rt_uint32_t last_mode;
    static char *run_str[] = PM_RUN_MODE_NAMES;
    struct PM_RCC_conf sconf = _pm_conf[mode];

    if (mode == last_mode)
        return;

    if (pm_run_freq[mode][0] != pm_run_freq[last_mode][0])
    {
        if (_pm_conf[last_mode].low_pow_run_en && !sconf.low_pow_run_en)
        {
            /* Disable the Low-power Run mode */
            HAL_PWREx_DisableLowPowerRunMode();
        }

        sysclock_msi_on(last_mode);

        if (mode < last_mode)
        {
            /* Frequency increase */
            HAL_PWREx_ControlVoltageScaling(sconf.volt_scale);

            _pm_set_sysclock[mode]();
        }
        else
        {
            /* Frequency reduce */
            _pm_set_sysclock[mode]();

            HAL_PWREx_ControlVoltageScaling(sconf.volt_scale);
        }

        if (sconf.volt_scale == PWR_REGULATOR_VOLTAGE_SCALE2 || _pm_osc.osc_type == RCC_OSCILLATORTYPE_MSI)
        {
            /* Configure the wake up from stop clock to MSI */
            __HAL_RCC_WAKEUPSTOP_CLK_CONFIG(RCC_STOP_WAKEUPCLOCK_MSI);
        }
        else
        {
            /* Configure the wake up from stop clock to HSI */
            __HAL_RCC_WAKEUPSTOP_CLK_CONFIG(RCC_STOP_WAKEUPCLOCK_HSI);
        }

        if (sconf.low_pow_run_en)
        {
            /* Enable the Low-power Run mode */
            HAL_PWREx_EnableLowPowerRunMode();
        }

        sysclock_msi_off(mode);

#if defined(RT_USING_SERIAL)
        /* Re-Configure the UARTs */
        uart_console_reconfig();
#endif
        /* Re-Configure the Systick time */
        HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / RT_TICK_PER_SECOND);
        /* Re-Configure the Systick */
        HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
    }

    last_mode = mode;
    rt_kprintf("switch to %s mode, frequency = %d %sHz\n",
               run_str[mode], pm_run_freq[mode][0], (pm_run_freq[mode][1] == 1) ? "M" : "K");

    if ((pm_run_freq[mode][0] / pm_run_freq[mode][1]) > OSC_CONF_SYS_FREQ_MAX)
        rt_kprintf("warning: The frequency has over than %d MHz\n", OSC_CONF_SYS_FREQ_MAX);
}

#endif /* defined(RT_USING_PM) */
